Revit 2027 API
BuiltInFailures.PipingFailures.PartNotFoundInRoutingPreferenceWarning Property
 "%1s is not found. Please review the routing preference of %2s."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PartNotFoundInRoutingPreferenceWarning { get; }
Public Shared ReadOnly Property PartNotFoundInRoutingPreferenceWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PartNotFoundInRoutingPreferenceWarning {
	FailureDefinitionId^ get ();
}
static member PartNotFoundInRoutingPreferenceWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace